In [78]:
import sqlite3
import pandas as pd

In [79]:
con = sqlite3.connect('../new_data.db')

In [80]:
# data = pd.read_sql('select * from transactions_1', dbase)
# data.head()

In [97]:
registered = pd.DataFrame(columns=['ID','Name','Email','Password', 'Type','PhoneNo'])

In [98]:
registered = registered.append({'ID':1,  'Name':'Aman',  'Email':'aman.r1298@gmail.com', 'Password':'aman123',   'Type':'retailer',  'PhoneNo':'8810419775'},    ignore_index = True)
registered = registered.append({'ID':2,  'Name':'Sonu',  'Email':'sonu@gmail.com',   'Password':'sonu123',   'Type':'retailer',  'PhoneNo':'8810419700'},    ignore_index = True)
registered = registered.append({'ID':3,  'Name':'Aakash',  'Email':'aakash@gmail.com',   'Password':'aakash123',    'Type':'customer',    'PhoneNo':'1234567890'},    ignore_index = True)
registered = registered.append({'ID':4,  'Name':'Ashutosh',  'Email':'ashutosh@gmail.com',   'Password':'ashutosh123',   'Type':'customer',  'PhoneNo':'9910419775'},    ignore_index = True)

In [99]:
registered

  ID      Name                 Email     Password      Type     PhoneNo
0  1      Aman  aman.r1298@gmail.com      aman123  retailer  8810419775
1  2      Sonu        sonu@gmail.com      sonu123  retailer  8810419700
2  3    Aakash      aakash@gmail.com    aakash123  customer  1234567890
3  4  Ashutosh    ashutosh@gmail.com  ashutosh123  customer  9910419775

In [100]:
registered.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ID        4 non-null      object
 1   Name      4 non-null      object
 2   Email     4 non-null      object
 3   Password  4 non-null      object
 4   Type      4 non-null      object
 5   PhoneNo   4 non-null      object
dtypes: object(6)
memory usage: 320.0+ bytes

In [101]:
registered.to_sql('registration_data', dbase)

In [109]:
registered.to_csv('./registration_data/registration_data.csv', index=False)

In [102]:
retailer = pd.DataFrame(columns=['retailor_id', 'Name', 'Store_table', 'Sales_table', 'Transactions_table'])

In [103]:
retailer = retailer.append({'retailor_id':1,  'Name':'Aman',  'Store_table': 'store_1', 'Sales_table': 'sales_1' ,'Transactions_table' : 'transactions_1'},    ignore_index = True)
retailer = retailer.append({'retailor_id':2,  'Name':'Sonu',  'Store_table': 'store_2', 'Sales_table': 'sales_2' , 'Transactions_table' : 'transactions_2'},    ignore_index = True)

In [108]:
retailer

  retailor_id  Name Store_table Sales_table Transactions_table
0           1  Aman     store_1     sales_1     transactions_1
1           2  Sonu     store_2     sales_2     transactions_2

In [105]:
retailer.to_sql('retailor_data', dbase)

In [111]:
retailer.to_csv('./retailer/retailer_data.csv', index=False)

# Updating dates to 9 years+

In [69]:
cursorObj = con.cursor()

In [81]:
transactions = pd.read_sql_query('select * from transactions_1', con)
transactions2 = pd.read_sql_query('select * from transactions_2', con)

In [83]:
transactions2.tail()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
824343,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
824344,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
824345,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
824346,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France
824347,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France

In [72]:
len(transactions['InvoiceDate'].unique())

20486

OperationalError: near "9": syntax error

In [73]:
# sql = "update transactions_1 set InvoiceDate = REPLACE(InvoiceDate,'2010','2019')"
# cursorObj.execute(sql, con)

In [74]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406855 entries, 0 to 406854
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      406855 non-null  object
 1   StockCode    406855 non-null  object
 2   Description  406855 non-null  object
 3   Quantity     406855 non-null  int64
 4   InvoiceDate  406855 non-null  object
 5   Price        406855 non-null  float64
 6   Customer ID  406855 non-null  float64
 7   Country      406855 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 24.8+ MB

In [84]:
transactions["InvoiceDate"] = pd.to_datetime(transactions["InvoiceDate"])
transactions2["InvoiceDate"] = pd.to_datetime(transactions2["InvoiceDate"])

In [85]:
transactions['InvoiceDate'] = transactions['InvoiceDate']+pd.Timedelta(days=9*365)
transactions2['InvoiceDate'] = transactions2['InvoiceDate']+pd.Timedelta(days=9*365)

In [88]:
transactions2['InvoiceDate'].tail()

824343   2020-12-06 12:50:00
824344   2020-12-06 12:50:00
824345   2020-12-06 12:50:00
824346   2020-12-06 12:50:00
824347   2020-12-06 12:50:00
Name: InvoiceDate, dtype: datetime64[ns]

In [90]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406829 entries, 0 to 406828
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      406829 non-null  object
 1   StockCode    406829 non-null  object
 2   Description  406829 non-null  object
 3   Quantity     406829 non-null  int64
 4   InvoiceDate  406829 non-null  datetime64[ns]
 5   Price        406829 non-null  float64
 6   Customer ID  406829 non-null  float64
 7   Country      406829 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 24.8+ MB

In [91]:
transactions.to_sql('transactions_1', con, if_exists='replace')

In [93]:
transactions2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 824348 entries, 0 to 824347
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      824348 non-null  object
 1   StockCode    824348 non-null  object
 2   Description  824348 non-null  object
 3   Quantity     824348 non-null  int64
 4   InvoiceDate  824348 non-null  datetime64[ns]
 5   Price        824348 non-null  float64
 6   Customer ID  824348 non-null  float64
 7   Country      824348 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 50.3+ MB

In [94]:
transactions2.to_sql('transactions_2', con, if_exists='replace')